realsosy/InfineonRacer/2_src/InfineonRacer_TC23xA/0_Src/4_McHal/Tricore/Asclin/Asc/IfxAsclin_Asc.h
#ifndef IFXASCLIN_ASC_H
#define IFXASCLIN_ASC_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "Asclin/Std/IfxAsclin.h"
#include "_Lib/DataHandling/Ifx_Fifo.h"
#include "SysSe/Bsp/Bsp.h"
#include "StdIf/IfxStdIf_DPipe.h"

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \brief Structure for Error Flags
 */
typedef struct
{
    uint8 parityError : 1;       /**< \brief parity error */
    uint8 frameError : 1;        /**< \brief transmit complete/pending error */
    uint8 rxFifoOverflow : 1;    /**< \brief receive FIFO overflow error */
    uint8 rxFifoUnderflow : 1;   /**< \brief receive FIFO underflow error */
    uint8 txFifoOverflow : 1;    /**< \brief transmit FIFO overflow error */
} IfxAsclin_Asc_ErrorFlags;

/** \addtogroup IfxLld_Asclin_Asc_DataStructures
 * \{ */
/** \brief Structure for baudrate
 */
typedef struct
{
    float32                      baudrate;         /**< \brief value of the required baudrate */
    uint16                       prescaler;        /**< \brief BITCON.PRESCALER, the division ratio of the predevider */
    IfxAsclin_OversamplingFactor oversampling;     /**< \brief BITCON.OVERSAMPLING, division ratio of the baudrate post devider */
} IfxAsclin_Asc_BaudRate;

/** \brief Structure for bit timings
 */
typedef struct
{
    IfxAsclin_SamplesPerBit       medianFilter;            /**< \brief BITCON.SM, number of samples per bit (1 or 3), sample mode/median filter */
    IfxAsclin_SamplePointPosition samplePointPosition;     /**< \brief BITCON.SAMPLEPOINT, sample point position */
} IfxAsclin_Asc_BitTimingControl;

/** \brief Structure for FIFO control
 */
typedef struct
{
    IfxAsclin_TxFifoInletWidth     inWidth;                  /**< \brief TXFIFOCON.INW, transmit FIFO inlet width */
    IfxAsclin_RxFifoOutletWidth    outWidth;                 /**< \brief RXFIFOCON.OTW, receive FIFO oulet width */
    IfxAsclin_TxFifoInterruptLevel txFifoInterruptLevel;     /**< \brief TXFIFOCON.INTLEVEL, Tx FIFO interrupt level */
    IfxAsclin_RxFifoInterruptLevel rxFifoInterruptLevel;     /**< \brief RXFIFOCON.INTLEVEL, Rx FIFO interrupt level */
    IfxAsclin_ReceiveBufferMode    buffMode;                 /**< \brief RXFIFOCON.BUFF, receive buffer mode (Rx FIFO or Rx buffer) */
} IfxAsclin_Asc_FifoControl;

/** \brief Structure for frame control
 */
typedef struct
{
    IfxAsclin_IdleDelay      idleDelay;      /**< \brief FRAMECON.IDLE, idle delay */
    IfxAsclin_StopBit        stopBit;        /**< \brief FRAMECON.STOP, number of stop bits */
    IfxAsclin_FrameMode      frameMode;      /**< \brief FRAMECON.MODE, mode of operation of the module */
    IfxAsclin_ShiftDirection shiftDir;       /**< \brief FRAMECON.MSB, shift direction */
    IfxAsclin_ParityType     parityType;     /**< \brief FRAMECON.ODD, parity type (even or odd) */
    IfxAsclin_DataLength     dataLength;     /**< \brief DATCON.DATALENGTH, data length, number of bits per transfer */
    boolean                  parityBit;      /**< \brief FRAMECON.PEN, parity enable */
} IfxAsclin_Asc_FrameControl;

/** \brief Structure for interrupt configuration
 */
typedef struct
{
    uint16     txPriority;        /**< \brief transmit interrupt priority */
    uint16     rxPriority;        /**< \brief receive interrupt priority */
    uint16     erPriority;        /**< \brief error interrupt priority */
    IfxSrc_Tos typeOfService;     /**< \brief type of interrupt service */
} IfxAsclin_Asc_InterruptConfig;

/** \brief Structure for ASC pin configuration
 */
typedef struct
{
    const IfxAsclin_Cts_In  *cts;           /**< \brief ASC clear to send (CTS) pin */
    IfxPort_InputMode        ctsMode;       /**< \brief Cts pin as input */
    const IfxAsclin_Rx_In   *rx;            /**< \brief ASC Rx pin */
    IfxPort_InputMode        rxMode;        /**< \brief Rx pin as input */
    const IfxAsclin_Rts_Out *rts;           /**< \brief ASC (request to send) RTS pin */
    IfxPort_OutputMode       rtsMode;       /**< \brief Rts as output */
    const IfxAsclin_Tx_Out  *tx;            /**< \brief ASC Tx pin */
    IfxPort_OutputMode       txMode;        /**< \brief Tx as output */
    IfxPort_PadDriver        pinDriver;     /**< \brief pad driver */
} IfxAsclin_Asc_Pins;

/** \} */

/** \brief This union contains the error flags. In addition it allows to write and read to/from all flags as once via the ALL member.
 */
typedef union
{
    uint8                    ALL;
    IfxAsclin_Asc_ErrorFlags flags;
} IfxAsclin_Asc_ErrorFlagsUnion;

/** \addtogroup IfxLld_Asclin_Asc_DataStructures
 * \{ */
/** \brief Module Handle
 */
typedef struct
{
    Ifx_ASCLIN                   *asclin;               /**< \brief pointer to ASCLIN registers */
    Ifx_Fifo                     *tx;                   /**< \brief Transmit FIFO buffer */
    Ifx_Fifo                     *rx;                   /**< \brief Receive FIFO buffer */
    volatile boolean              txInProgress;         /**< \brief Ongoing transfer. Will be set by IfxAsclin_Asc_initiateTransmission, and cleared by IfxAsclin_Asc_isrTransmit */
    volatile boolean              rxSwFifoOverflow;     /**< \brief Will be set by IfxAsclin_Asc_isrReceive if the SW Fifo overflowed */
    IfxAsclin_Asc_ErrorFlagsUnion errorFlags;           /**< \brief error reported by ASCLIN during runtime (written by IfxAsclin_Asc_isrError) */
    Ifx_DataBufferMode            dataBufferMode;       /**< \brief Rx buffer mode */
    volatile uint32               sendCount;            /**< \brief Number of byte that are send out, this value is reset with the function Asc_If_resetSendCount() */
    volatile Ifx_TickTime         txTimestamp;          /**< \brief Time stamp of the latest send byte */
} IfxAsclin_Asc;

/** \brief Configuration structure of the module
 */
typedef struct
{
    Ifx_ASCLIN                    *asclin;             /**< \brief pointer to ASCLIN registers */
    IfxAsclin_Asc_BaudRate         baudrate;           /**< \brief structure for baudrate */
    IfxAsclin_Asc_BitTimingControl bitTiming;          /**< \brief structure for bit timings */
    IfxAsclin_Asc_FrameControl     frame;              /**< \brief structure for frame control */
    IfxAsclin_Asc_FifoControl      fifo;               /**< \brief structure for FIFO control */
    IfxAsclin_Asc_InterruptConfig  interrupt;          /**< \brief structure for interrupt configuration */
    const IfxAsclin_Asc_Pins      *pins;               /**< \brief structure for ASC pins */
    IfxAsclin_ClockSource          clockSource;        /**< \brief CSR.CLKSEL, clock source selection */
    IfxAsclin_Asc_ErrorFlagsUnion  errorFlags;         /**< \brief structure for error flags */
    Ifx_SizeT                      txBufferSize;       /**< \brief Size of the tx buffer */
    void                          *txBuffer;           /**< \brief The buffer parameter must point on a free memory location where the buffer object will be Initialised.
                                                        *
                                                        * The Size of this area must be at least equals to "txBufferSize + sizeof(Ifx_Fifo) + 8". Not tacking this in account may result in unpredictable behavior.
                                                        *
                                                        * If set to NULL_PTR, the buffer will  be allocated dynamically according to txBufferSize */
    Ifx_SizeT rxBufferSize;                            /**< \brief Size of the rx buffer */
    void     *rxBuffer;                                /**< \brief The buffer parameter must point on a free memory location where the buffer object will be Initialised.
                                                        *
                                                        * The Size of this area must be at least equals to "rxBufferSize + sizeof(Ifx_Fifo) + 8". Not tacking this in account may result in unpredictable behavior.
                                                        *
                                                        * If set to NULL, the buffer will be allocated dynamically according to rxBufferSize */
    boolean            loopBack;                       /**< \brief IOCR.LB, loop back mode selection, 0 for disable, 1 for enable */
    Ifx_DataBufferMode dataBufferMode;                 /**< \brief Rx buffer mode */
} IfxAsclin_Asc_Config;

